0mdb/robot-buddy/esp32-face/sdkconfig.defaults
# Target: ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# TinyUSB for composite device (CDC + UAC) — replaces USB Serial/JTAG console
CONFIG_TINYUSB_CDC_ENABLED=y

# Logging (routed through TinyUSB CDC)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# FreeRTOS: both cores enabled
CONFIG_FREERTOS_UNICORE=n

# Task watchdog
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5

# PSRAM (FNK0104 has 8MB octal PSRAM)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
